## 4. Î∂ÑÏÑù Î¨∏Î≤ï

In [3]:
import pandas as pd
df1 = pd.read_csv('sales_data.csv',encoding='utf-8-sig')
df1

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [26]:
display(df1.head(1),
        df1.tail(1))
df1.shape

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

(5, 10)

In [28]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    5 non-null      int64
 1   Name          5 non-null      object
 2   Gender        5 non-null      object
 3   Age           5 non-null      int64
 4   Country       5 non-null      object
 5   Product       5 non-null      object
 6   Category      5 non-null      object
 7   Price         4 non-null      float64
 8   Quantity      5 non-null      int64
 9   PurchaseDate  5 non-null      object
dtypes: float64(1), int64(3), object(6)
memory usage: 532.0+ bytes

In [38]:
display(df1.columns,
        df1.index)

Index(['CustomerID', 'Name', 'Gender', 'Age', 'Country', 'Product', 'Category',
       'Price', 'Quantity', 'PurchaseDate'],
      dtype='object')

RangeIndex(start=0, stop=5, step=1)

In [40]:
df1.describe()

        CustomerID        Age       Price  Quantity
count     5.000000   5.000000    4.000000  5.000000
mean   1003.000000  28.000000  545.000000  1.200000
std       1.581139   4.949747  253.179778  0.447214
min    1001.000000  22.000000  300.000000  1.000000
25%    1002.000000  25.000000  435.000000  1.000000
50%    1003.000000  28.000000  490.000000  1.000000
75%    1004.000000  30.000000  600.000000  1.000000
max    1005.000000  35.000000  900.000000  2.000000

In [62]:
## enumerateÎäî Î¶¨Ïä§Ìä∏Î•º ÎèåÎ©¥ÏÑú Ïù∏Îç±Ïä§ Í∞íÍ≥º Ìï¥Îãπ ÏöîÏÜåÍ∞íÏùÑ Í∞ôÏù¥ Î∞òÌôò

list=df1['Name'].tolist()
display(list)
for index,location in enumerate(list):
    print(index+1,location)

['Alice', 'Bob', 'Charlie', 'Daisy', 'Ethan']

1 Alice
2 Bob
3 Charlie
4 Daisy
5 Ethan

In [66]:
## Ïó¥Í∞ÑÏùò ÏÉÅÍ¥ÄÍ¥ÄÍ≥Ñ 
df1.corr(numeric_only=True)

              CustomerID       Age     Price      Quantity
CustomerID  1.000000e+00  0.574989 -0.520110  3.925231e-17
Age         5.749889e-01  1.000000  0.464567 -6.776309e-01
Price      -5.201104e-01  0.464567  1.000000 -1.711564e-01
Quantity    3.925231e-17 -0.677631 -0.171156  1.000000e+00

In [96]:
# ÌäπÏ†ï Ïó¥Ïóê Ìè¨Ìï®ÎêòÏñ¥ÏûàÎäî Í∞íÏùò Ï¢ÖÎ•ò
display(df1['Gender'].unique())

# ÌäπÏ†ï Ïó¥Ïóê Ìè¨Ìï®ÎêòÏñ¥ÏûàÎäî Í∞íÏùò Í∞úÏàò
display(df1['Gender'].nunique())

# Îç∞Ïù¥ÌÑ∞ Ïó¥Ïùò ÏÇ¨Ïù¥Ï¶àÎ•º Î≥¥Ïó¨Ï§ÄÎã§ 5Í∞úÏùò Í∞íÏúºÎ°ú Ïù¥Î§ÑÏßê
display(df1['Gender'].count())

# ÌäπÏ†ï Ïó¥Ïóê Ìè¨Ìï®ÎêòÏñ¥ ÏûàÎäî Í∞íÏùò Ï¢ÖÎ•òÎ≥Ñ Í∞úÏàò
# normalize=True Îäî ÎπÑÏú®Î°ú ÌëúÏãú
display(df1['Gender'].value_counts(normalize=True))

# Ïà´ÏûêÌòï Î≥ÄÏàòÎ•º Íµ¨Í∞ÑÏúºÎ°ú Î∂ÑÎ¶¨  bins=2 ÎëêÍ∞úÏùò Íµ¨Í∞ÑÏúºÎ°ú ÎÇòÎàî
display(df1['Age'].value_counts(bins=2))

array(['Female', 'Male'], dtype=object)

2

5

Gender
Male      0.6
Female    0.4
Name: proportion, dtype: float64

(21.985999999999997, 28.5]    3
(28.5, 35.0]                  2
Name: count, dtype: int64

### pivot_table(),crosstab(),groupby()

In [108]:
# ÎëêÍ∞úÏùò Ïó¥Ïùò Ï°∞Ìï© 
Ï°∞Ìï©=df1[['Quantity','Gender']].value_counts()
Ï°∞Ìï©

Quantity  Gender
1         Female    2
          Male      2
2         Male      1
Name: count, dtype: int64

In [132]:
display(Ï°∞Ìï©.sort_index().to_frame())

# ÌîºÎ≤óÌÖåÏù¥Î∏îÏù¥ÎûÄ?
#üëâ ‚ÄúÌñâÍ≥º Ïó¥ Í∏∞Ï§ÄÏúºÎ°ú Îç∞Ïù¥ÌÑ∞Î•º Îã§Ïãú Ï†ïÎ¶¨ÌïòÍ≥†, ÏõêÌïòÎäî Í∞íÎì§ÏùÑ ÏöîÏïΩÌï¥ÏÑú Î≥¥Ïó¨Ï£ºÎäî Ìëú
# ÌÜµÍ≥ÑÏ†Å ÏöîÏïΩ,ÏàòÏπòÍ≥ÑÏÇ∞Ïóê Ïú†Ïö©Ìï® 
display(Ï°∞Ìï©.sort_index().to_frame().unstack())

                 count
Quantity Gender
1        Female      2
         Male        2
2        Male        1

          count
Gender   Female Male
Quantity
1           2.0  2.0
2           NaN  1.0

In [41]:
df1.pivot_table(index='Quantity', columns='Gender', values='CustomerID', aggfunc='count') ## agg_fun='mean'Ïù¥ Í∏∞Î≥∏Í∞í
#  fill_value=None  nanÏùÑ  ÎåÄÏ≤¥
#  dropna=True      nanÏùÑ Ï†úÍ±∞

Gender    Female  Male
Quantity
1            2.0   2.0
2            NaN   1.0

In [49]:
# ÌÅ¨Î°úÏä§ÌÉ≠Ïù¥ÎûÄ?
# Îã®Ïàú ÎπàÎèÑÌëú,ÍµêÏ∞®Ìëú ÎßåÎì§Í∏∞Ïóê Ïú†Ïö©Ìï®

pd.crosstab(index=df1['Quantity'],columns=df1['Gender'])

Gender    Female  Male
Quantity
1              2     2
2              0     1

In [53]:
## nullÍ∞íÏùÄ Í∞úÏàòÎ°ú ÏπòÏßÄ ÏïäÏùå
df1['Price'].size

5

In [141]:
df1.groupby(['Gender'])['Quantity'].sum()

Gender
Female    2
Male      4
Name: Quantity, dtype: int64

In [61]:
df1.groupby(['Gender','Quantity'])[['Age']].count()

                 Age
Gender Quantity
Female 1           2
Male   1           2
       2           1

In [67]:
df1.groupby(['Gender','Quantity']).size().to_frame()

                 0
Gender Quantity
Female 1         2
Male   1         2
       2         1

### Ïª¨ÎüºÏùò ÏÑ†ÌÉù /ÏàòÏ†ï /ÏÇ≠Ï†ú /Í≤∞Ï∏°

In [70]:
df1

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [74]:
df1[['Name','Gender']]

      Name  Gender
0    Alice  Female
1      Bob    Male
2  Charlie    Male
3    Daisy  Female
4    Ethan    Male

In [82]:
df1[df1['Name']=='Bob']

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00

In [90]:
df1.isnull().sum()

CustomerID      0
Name            0
Gender          0
Age             0
Country         0
Product         0
Category        0
Price           1
Quantity        0
PurchaseDate    0
dtype: int64

In [108]:
display(df1.dropna()) # Í≤∞Ï∏°Ïπò ÏûàÎäî Î™®Îì† Ìñâ ÏÇ≠Ï†ú
display(df1.dropna(subset=['Price'])) # subset Ïó¥Ïóê Ï°¥Ïû¨ÌïòÎäî Í≤∞Ï∏°ÏπòÍ∞Ä Ìè¨Ìï®Îêú ÌñâÎßå ÏÇ≠Ï†ú
display(df1.drop(df1[df1['Price']<500].index))  # Ï°∞Í±¥Ïóê ÎßûÍ≤å ÏÇ≠Ï†úÌïòÍ∏∞

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00

In [ ]:
df1.fillna(1200) # Í≤∞Ï∏°ÏπòÎ•º 1200ÏúºÎ°ú ÎåÄÏ≤¥

### np.where / query()

- np.where(Ï°∞Í±¥, Ï°∞Í±¥Ïù¥ Ï∞∏Ïùº Îïå Í∞í, Ï°∞Í±¥Ïù¥ Í±∞ÏßìÏùº Îïå Í∞í)
- query()Îäî Ï°∞Í±¥ÏúºÎ°ú Ìñâ ÌïÑÌÑ∞ÎßÅÌï† Îïå ÏÇ¨Ïö©

In [237]:
import numpy as np
df1['Í∞ÄÍ≤© Ï∏°Ï†ï']= np.where(df1['Price']<500,'Ïã∏Îã§','ÎπÑÏã∏Îã§')

In [239]:
df1.head(1)

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,Í∞ÄÍ≤© Ï∏°Ï†ï
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§

In [ ]:
# Îã§Îã®Í≥Ñ Î∂ÑÎ•ò 
df1['PriceLabel'] = np.where(df1['Price'] < 300, 'Îß§Ïö∞Ï†ÄÍ∞Ä',
                      np.where(df1['Price'] < 500, 'Ï†ÄÍ∞Ä',
                        np.where(df1['Price'] < 800, 'Ï§ëÍ∞Ä', 'Í≥†Í∞Ä')))

In [133]:
df1.query("Price<500 and Gender == 'Male'") ## Î≤îÏ£ºÌòïÎ≥ÄÏàòÎäî '  '  Î°ú Î¨∂Ïñ¥Ï§òÏïºÌï®

,CustomerID,Name,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,Í∞ÄÍ≤© Ï∏°Ï†ï
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§

In [241]:
# ÏπºÎüºÎ™Ö Î≥ÄÍ≤ΩÌïòÍ∏∞ 

df1.rename(columns={'Name':'Ïù¥Î¶Ñ'})

,CustomerID,Ïù¥Î¶Ñ,Gender,Age,Country,Product,Category,Price,Quantity,PurchaseDate,Í∞ÄÍ≤© Ï∏°Ï†ï
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§

In [243]:
df1.columns=['Í≥†Í∞ùID','Ïù¥Î¶Ñ','ÏÑ±Î≥Ñ','ÎÇòÏù¥','Íµ≠Í∞Ä','ÏÉÅÌíà','Ïπ¥ÌÖåÍ≥†Î¶¨','Í∞ÄÍ≤©','ÏàòÎüâ','Íµ¨Îß§ÎÇ†Ïßú','Í∞ÄÍ≤©Ï∏°Ï†ï']

In [245]:
df1

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§

In [163]:
# Ï§ëÎ≥µÌñâ ÌôïÏù∏ÌïòÍ∏∞

df1.duplicated().sum()

0

In [ ]:
df1.drop_duplicated() # Ï§ëÎ≥µÌñâ Ï†úÍ±∞  # subset= ['Ïó¥Ïù¥Î¶Ñ1',Ïó¥Ïù¥Î¶Ñ2]  , keep='first  ÌååÎùºÎØ∏ÌÑ∞ ÏÇ¨Ïö©Ïãú  Ï§ëÎ≥µÏùò Ï≤´Î≤àÏß∏Îßå ÎÇ®Í∏∏ÏàòÏûàÏùå

## Îç∞Ïù¥ÌÑ∞ Î≥ëÌï©

In [170]:
# Îç∞Ïù¥ÌÑ∞ Ìï©ÏπòÍ∏∞
display(pd.concat([df1['Ïù¥Î¶Ñ'],df1['Íµ≠Í∞Ä']],axis=0))
display(pd.concat([df1['Ïù¥Î¶Ñ'],df1['Íµ≠Í∞Ä']],axis=1))

0      Alice
1        Bob
2    Charlie
3      Daisy
4      Ethan
0        USA
1         UK
2      Korea
3        USA
4     Canada
dtype: object

        Ïù¥Î¶Ñ      Íµ≠Í∞Ä
0    Alice     USA
1      Bob      UK
2  Charlie   Korea
3    Daisy     USA
4    Ethan  Canada

In [172]:
df1

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§

In [174]:
df1_merge1=df1[['ÏÑ±Î≥Ñ','Íµ≠Í∞Ä']]
df2_merge2=df1[['ÏÑ±Î≥Ñ','Í∞ÄÍ≤©Ï∏°Ï†ï']]

In [176]:
pd.merge(df1_merge1,df2_merge2,on='ÏÑ±Î≥Ñ',how='inner')

        ÏÑ±Î≥Ñ      Íµ≠Í∞Ä Í∞ÄÍ≤©Ï∏°Ï†ï
0   Female     USA  ÎπÑÏã∏Îã§
1   Female     USA   Ïã∏Îã§
2     Male      UK  ÎπÑÏã∏Îã§
3     Male      UK   Ïã∏Îã§
4     Male      UK  ÎπÑÏã∏Îã§
5     Male   Korea  ÎπÑÏã∏Îã§
6     Male   Korea   Ïã∏Îã§
7     Male   Korea  ÎπÑÏã∏Îã§
8   Female     USA  ÎπÑÏã∏Îã§
9   Female     USA   Ïã∏Îã§
10    Male  Canada  ÎπÑÏã∏Îã§
11    Male  Canada   Ïã∏Îã§
12    Male  Canada  ÎπÑÏã∏Îã§

## 5. Í∏∞ÌÉÄÌï®Ïàò
### apply(),split(),lstrip(),replace(),Startwith(),map()

In [200]:
# applyÎäî ÌäπÏ†ï Ïó¥Ïùò ÌñâÏùÑ ÏûêÎèôÏúºÎ°ú ÎèåÍ∏∞ ÎïåÎ¨∏Ïóê forÏùÑ Ïì∞ÏßÄ ÏïäÏïÑÎèÑÎê®
def Ìï†Ïù∏(row):
    if row['Í∞ÄÍ≤©Ï∏°Ï†ï']=='ÎπÑÏã∏Îã§':
        return 'Ìï†Ïù∏ÌïÑÏöî'
    else:
        return 'Ìï†Ïù∏Î∂àÌïÑÏöî'
    
# df1Ïùò ÌïòÎÇòÏùò ÌñâÏùÑ Ìï†Ïù∏Ïù¥ÎùºÎäî Ìï®ÏàòÏóê ÎåÄÏûÖÌïòÎùº.
df1['Ìï†Ïù∏ÌïÑÏöî']=df1.apply(Ìï†Ïù∏,axis=1)

In [202]:
df1

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï,Ìï†Ïù∏ÌïÑÏöî
0,1001,Alice,Female,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§,Ìï†Ïù∏ÌïÑÏöî
1,1002,Bob,Male,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§,Ìï†Ïù∏ÌïÑÏöî
2,1003,Charlie,Male,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§,Ìï†Ïù∏Î∂àÌïÑÏöî
3,1004,Daisy,Female,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§,Ìï†Ïù∏Î∂àÌïÑÏöî
4,1005,Ethan,Male,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§,Ìï†Ïù∏ÌïÑÏöî

In [204]:
txt = "ÏÇ¨Í≥º,Î∞îÎÇòÎÇò,Ìè¨ÎèÑ"
txt.split(",")

['ÏÇ¨Í≥º', 'Î∞îÎÇòÎÇò', 'Ìè¨ÎèÑ']

In [206]:
"$$$ÎèàÎßéÏùÄÏÇ¨Îûå".lstrip("$")

'ÎèàÎßéÏùÄÏÇ¨Îûå'

In [208]:
"2024/06/29".replace("/", "-")

'2024-06-29'

In [220]:
df1['Ïπ¥ÌÖåÍ≥†Î¶¨'].str.startswith('P')

0     True
1    False
2     True
3    False
4    False
Name: Ïπ¥ÌÖåÍ≥†Î¶¨, dtype: bool

In [247]:
# map() Ïñ¥Îñ§ Í∞íÏùÑ ÌäπÏ†ï Í∞íÏúºÎ°ú ÏπòÌôòÌïòÍ≥† Ïã∂ÏùÑÎñÑ
Gender_map={'Female':'Ïó¨ÏÑ±','Male':'ÎÇ®ÏÑ±'}
df1['ÏÑ±Î≥Ñ']=df1['ÏÑ±Î≥Ñ'].map(Gender_map)

In [249]:
df1

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï
0,1001,Alice,Ïó¨ÏÑ±,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
1,1002,Bob,ÎÇ®ÏÑ±,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
2,1003,Charlie,ÎÇ®ÏÑ±,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§
3,1004,Daisy,Ïó¨ÏÑ±,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
4,1005,Ethan,ÎÇ®ÏÑ±,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§

### list_compression 

[ÌëúÌòÑÏãù for Î≥ÄÏàò in Î∞òÎ≥µÍ∞ÄÎä•ÌïúÍ∞ùÏ≤¥]

In [259]:
#Î¨∏Ï†ú 1: 1Î∂ÄÌÑ∞ 5ÍπåÏßÄÏùò Ï†úÍ≥± Î¶¨Ïä§Ìä∏ ÎßåÎì§Í∏∞

[x**2 for x in range(1,6)]

[1, 4, 9, 16, 25]

In [263]:
#Î¨∏Ï†ú 2: 1Î∂ÄÌÑ∞ 10ÍπåÏßÄ Ï§ë ÏßùÏàòÎßå Î¨∏ÏûêÏó¥Î°ú Î∞îÍøî Î¶¨Ïä§Ìä∏Î°ú

[x for x in range(1,11) if x%2 == 0]

[2, 4, 6, 8, 10]

In [265]:
#Î¨∏Ï†ú 3: Ïà´Ïûê Î¶¨Ïä§Ìä∏ [3, 7, 2, 1, 9]ÏóêÏÑú 5Î≥¥Îã§ ÌÅ¨Î©¥ 'Big', ÏûëÏúºÎ©¥ 'Small'

['big' if x>5 else 'small' for x in [3,7,2,1,9]]

['small', 'big', 'small', 'small', 'big']

In [277]:
## Ï†ïÎ†¨

display(df1.sort_values(by='ÎÇòÏù¥',ascending=False))

## Ïù∏Îç±Ïä§ Ï†ïÎ†¨

df1.sort_index()

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï
4,1005,Ethan,ÎÇ®ÏÑ±,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§
1,1002,Bob,ÎÇ®ÏÑ±,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
3,1004,Daisy,Ïó¨ÏÑ±,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
0,1001,Alice,Ïó¨ÏÑ±,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
2,1003,Charlie,ÎÇ®ÏÑ±,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§

,Í≥†Í∞ùID,Ïù¥Î¶Ñ,ÏÑ±Î≥Ñ,ÎÇòÏù¥,Íµ≠Í∞Ä,ÏÉÅÌíà,Ïπ¥ÌÖåÍ≥†Î¶¨,Í∞ÄÍ≤©,ÏàòÎüâ,Íµ¨Îß§ÎÇ†Ïßú,Í∞ÄÍ≤©Ï∏°Ï†ï
0,1001,Alice,Ïó¨ÏÑ±,25,USA,A101,Phone,500.0,1,2023-01-05 10:23:00,ÎπÑÏã∏Îã§
1,1002,Bob,ÎÇ®ÏÑ±,30,UK,B202,Laptop,900.0,1,2022-11-11 16:02:00,ÎπÑÏã∏Îã§
2,1003,Charlie,ÎÇ®ÏÑ±,22,Korea,C303,Phone,480.0,2,2023-08-20 13:40:00,Ïã∏Îã§
3,1004,Daisy,Ïó¨ÏÑ±,28,USA,D404,Tablet,300.0,1,2023-06-01 08:00:00,Ïã∏Îã§
4,1005,Ethan,ÎÇ®ÏÑ±,35,Canada,E505,Laptop,NaN,1,2023-03-03 19:15:00,ÎπÑÏã∏Îã§

In [285]:
#Î¶¨Ïä§Ìä∏ Ï†ïÎ†¨
list1=[3, 7, 2, 1, 9]
list1.sort() # key ÌååÎùºÎØ∏ÌÑ∞ ÏÇ¨Ïö©Ïãú Ï°∞Í±¥Ïóê ÎßûÏ∂∞ Ï†ïÎ†¨Í∞ÄÎä• 
list1

[1, 2, 3, 7, 9]

## lamda Ìï®Ïàò
### lambda Îß§Í∞úÎ≥ÄÏàò: ÌëúÌòÑÏãù

In [292]:
add= lambda a,b : a+b
add(3,5)

8

In [296]:
ÌôÄÏßù= lambda x: 'ÏßùÏàò' if x%2==0 else 'ÌôÄÏàò'
ÌôÄÏßù(3)

'ÌôÄÏàò'

In [ ]:
# applyÏôÄ Ìï®Íºê Í≤∞Ìï©
df['Ïπ¥ÌÖåÍ≥†Î¶¨'] = df['Í∞ÄÍ≤©'].apply(lambda x: 'Í≥†Í∞Ä' if x > 1000 else 'Ï†ÄÍ∞Ä')

## qcut,cut,agg